test/fixtures/refund_create.json

{
  "object": "refund",
  "id": "rfnd_test_52pe9k4bj1yqy2p1d42",
  "location": "/charges/chrg_test_52oo08bwpgnwb95rye8/refunds/rfnd_test_52pe9k4bj1yqy2p1d42",
  "amount": 5000,
  "currency": "thb",
  "charge": "chrg_test_52oo08bwpgnwb95rye8",
  "transaction": "trxn_test_52pe9k4gplpjuvq53fm",
  "created": "2016-01-16T07:15:51Z"
}
