test/fixtures/refunds_list.json

{
  "object": "list",
  "from": "1970-01-01T07:00:00+07:00",
  "to": "2016-01-16T14:07:52+07:00",
  "offset": 0,
  "limit": 20,
  "total": 2,
  "order": "chronological",
  "location": "/charges/chrg_test_52oo08bwpgnwb95rye8/refunds",
  "data": [
    {
      "object": "refund",
      "id": "rfnd_test_52oo08fnmjlb61n8yda",
      "location": "/charges/chrg_test_52oo08bwpgnwb95rye8/refunds/rfnd_test_52oo08fnmjlb61n8yda",
      "amount": 50000,
      "currency": "thb",
      "charge": "chrg_test_52oo08bwpgnwb95rye8",
      "transaction": "trxn_test_52oo08fu85vch6y42c8",
      "created": "2016-01-14T10:30:25Z"
    },
    {
      "object": "refund",
      "id": "rfnd_test_52oo08h9wxifqf45dky",
      "location": "/charges/chrg_test_52oo08bwpgnwb95rye8/refunds/rfnd_test_52oo08h9wxifqf45dky",
      "amount": 10000,
      "currency": "thb",
      "charge": "chrg_test_52oo08bwpgnwb95rye8",
      "transaction": "trxn_test_52oo08hfy72ey43nrlp",
      "created": "2016-01-14T10:30:25Z"
    }
  ]
}
